{
    "https://w3id.org/FAIR_Evaluator/metrics/1": {
        "description": "Metric to test if the metadata resource has a unique identifier. This is done by comparing the GUID to the patterns (by regexp) of known GUID schemas such as URLs and DOIs. Known schema are registered in FAIRSharing (https://fairsharing.org/standards/?q=&selected_facets=type_exact:identifier%20schema)",
        "test_name": "FAIR Metrics Gen2- Unique Identifier"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/2": {
        "description": "Metric to test if the unique identifier of the metadata resource is likely to be persistent. Known schema are registered in FAIRSharing (https://fairsharing.org/standards/?q=&selected_facets=type_exact:identifier%20schema). For URLs that don't follow a schema in FAIRSharing we test known URL persistence schemas (purl, oclc, fdlp, purlz, w3id, ark).",
        "test_name": "FAIR Metrics Gen2 - Identifier Persistence"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/4": {
        "description": "Tests whether a machine is able to find structured metadata. This could be (for example) RDFa, embedded json, json-ld, or content-negotiated structured metadata such as RDF Turtle",
        "test_name": "FAIR Metrics Gen2 - Structured Metadata"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/5": {
        "description": "Tests whether a machine is able to find 'grounded' metadata. i.e. metadata terms that are in a resolvable namespace, where resolution leads to a definition of the meaning of the term. Examples include JSON-LD, embedded schema, or any form of RDF. This test currently excludes XML, even when terms are namespaced. Future versions of this test may be more flexible.",
        "test_name": "FAIR Metrics Gen2 - Grounded Metadata"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/6": {
        "description": "Metric to test if the metadata contains the unique identifier to the data. This is done by searching for a variety of properties, including foaf:primaryTopic, schema:mainEntity, schema:distribution, sio:is-about, and iao:is-about. schema codeRepository is used for software releases.",
        "test_name": "FAIR Metrics Gen2 - Data Identifier Explicitly In Metadata"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/7": {
        "description": "Metric to test if the metadata contains the unique identifier to the metadata itself. This is done using a variety of 'scraping' tools, including DOI metadata resolution, the use of the 'extruct' Python tool, and others...",
        "test_name": "FAIR Metrics Gen2- Metadata Identifier Explicitly In Metadata"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/8": {
        "description": "Tests whether a machine is able to discover the resource by search, using Microsoft Bing",
        "test_name": "FAIR Metrics Gen2 - Searchable in major search engine"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/10": {
        "description": "Metadata may be retrieved by an open and free protocol. Tests metadata GUID for its resolution protocol. Currently passes InChI Keys, DOIs, Handles, and URLs. Recognition of other identifiers will be added upon request by the community.",
        "test_name": "FAIR Metrics Gen2 - Uses open free protocol for metadata retrieval"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/13": {
        "description": "Metric to test if the metadata contains a persistence policy, explicitly identified by a persistencePolicy key (in hashed data) or a http://www.w3.org/2000/10/swap/pim/doc#persistencePolicy predicate in Linked Data.",
        "test_name": "FAIR Metrics Gen2 - Metadata Persistence"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/17": {
        "description": "Maturity Indicator to test if the data uses a formal language broadly applicable for knowledge representation. This particular test takes a broad view of what defines a 'knowledge representation language'; in this evaluation, a knowledge representation language is interpreted as one in which terms are semantically-grounded in ontologies. Any form of ontologically-grounded linked data will pass this test.",
        "test_name": "FAIR Metrics Gen2 - Data Knowledge Representation Language (strong)"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/19": {
        "description": "Maturity Indicator to test if the linked data metadata uses terms that resolve to linked (FAIR) data.",
        "test_name": "FAIR Metrics Gen2 - Metadata uses FAIR vocabularies (strong)"
    },
    "https://w3id.org/FAIR_Evaluator/metrics/22": {
        "description": "Maturity Indicator to test if the metadata contains an explicit pointer to the license. This 'weak' test will use a case-insensitive regular expression, and scan both key/value style metadata, as well as linked data metadata. Tests: xhtml, dvia, dcterms, cc, data.gov.au, and Schema license predicates in linked data, and validates the value of those properties.",
        "test_name": "FAIR Metrics Gen2 - Metadata Includes License"
    }
}